<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%233%20DataFrame%20%EC%9D%B8%EB%8D%B1%EC%8B%B1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
data = {"names" :  ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
        "year" : [2014, 2015, 2016, 2015, 2016],
        "points" : [1.5, 1.7, 3.6, 2.4, 2.9] }

df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                        index=["one","two","three", "four","five"])

In [4]:
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

#DataFrame 열 조작

**DataFrame에서 하나의 열 또는 행을 선택했을때 결과는 series의 형태로 나온다**

In [5]:
df["year"]

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [6]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [7]:
df[["year","points"]]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [0]:
df.penalty = 0.5

In [9]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [0]:
df.penalty = [0.1, 0.2, 0.3, 0.4, 0.5]

**새로운 열 추가** ~df.zeros는 오류남~

In [0]:
df["zeros"] = np.arange(5)

**series형태로 새로운 열 추가**

In [0]:
val = pd.Series([1.2, 1.3, 1.5], index = ["one", "three", "four"])

In [0]:
df["debt"] = val

In [17]:
df

       year    names  points  penalty  zeros  debt
one    2014    Kilho     1.5      0.1      0   1.2
two    2015    Kilho     1.7      0.2      1   NaN
three  2016    Kilho     3.6      0.3      2   1.3
four   2015  Charles     2.4      0.4      3   1.5
five   2016  Charles     2.9      0.5      4   NaN

**기존 열 삭제**

In [0]:
del df["debt"]

In [19]:
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

In [20]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'zeros'], dtype='object')

In [0]:
df.index.name = "Order"
df.columns.name = "Info"

In [22]:
df

Info   year    names  points  penalty  zeros
Order
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

#DataFrame 행 조작

In [24]:
df[0:3]

Info   year  names  points  penalty  zeros
Order
one    2014  Kilho     1.5      0.1      0
two    2015  Kilho     1.7      0.2      1
three  2016  Kilho     3.6      0.3      2

In [28]:
#비추하는 indexing 방식
df["two":"four"]

Info   year    names  points  penalty  zeros
Order
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3

In [30]:
#.ioc나 .loc 활용 추천
#.loc - 실제 index를 사용하여 행을 가져옴
df.loc["two"]

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
zeros          1
Name: two, dtype: object

In [31]:
df.loc["two" : "four"]

Info   year    names  points  penalty  zeros
Order
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3

In [32]:
df.loc["two" :"four" , "points"]

Order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [0]:
df.loc["six", :] = [2013, "Hayoung", 4.0, 0.1, 2.1]

In [35]:
df

Info     year    names  points  penalty  zeros
Order
one    2014.0    Kilho     1.5      0.1    0.0
two    2015.0    Kilho     1.7      0.2    1.0
three  2016.0    Kilho     3.6      0.3    2.0
four   2015.0  Charles     2.4      0.4    3.0
five   2016.0  Charles     2.9      0.5    4.0
six    2013.0  Hayoung     4.0      0.1    2.1

In [37]:
#.iloc - numpy의 array indexing 방식으로 행을 가져옴
df.iloc[3]

Info
year          2015
names      Charles
points         2.4
penalty        0.4
zeros            3
Name: four, dtype: object

In [38]:
df.iloc[0:3, 1:3]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [39]:
df.iloc[[0,2,4], [1,3]]

Info     names  penalty
Order
one      Kilho      0.1
three    Kilho      0.3
five   Charles      0.5

In [40]:
df.iloc[1,1]

'Kilho'

#DataFrame의 Boolean Indexing

In [41]:
df

Info     year    names  points  penalty  zeros
Order
one    2014.0    Kilho     1.5      0.1    0.0
two    2015.0    Kilho     1.7      0.2    1.0
three  2016.0    Kilho     3.6      0.3    2.0
four   2015.0  Charles     2.4      0.4    3.0
five   2016.0  Charles     2.9      0.5    4.0
six    2013.0  Hayoung     4.0      0.1    2.1

In [43]:
#결과값을 Mask라 부름
df["year"] > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [44]:
df.loc[df["year"]>2014, :]

Info     year    names  points  penalty  zeros
Order
two    2015.0    Kilho     1.7      0.2    1.0
three  2016.0    Kilho     3.6      0.3    2.0
four   2015.0  Charles     2.4      0.4    3.0
five   2016.0  Charles     2.9      0.5    4.0

ValueError: ignored